In [1]:
import numpy as np
import pandas as pd
titanic = pd.read_csv(r"C:\Users\Lenovo\Downloads\titanic.csv")
titanic.shape

(891, 12)

In [2]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
titanic.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [4]:
titanic.sample(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
460,461,1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.5500,E12,S
72,73,0,2,"Hood, Mr. Ambrose Jr",male,21.0,0,0,S.O.C. 14879,73.5000,NaN,S
677,678,1,3,"Turja, Miss. Anna Sofia",female,18.0,0,0,4138,9.8417,NaN,S
751,752,1,3,"Moor, Master. Meier",male,6.0,0,1,392096,12.4750,E121,S

In [5]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [6]:
list(titanic.columns)

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [7]:
titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [10]:
titanic.Sex.unique()

array(['male', 'female'], dtype=object)

In [12]:
titanic.SibSp.unique()

array([1, 0, 3, 4, 2, 5, 8])

In [13]:
titanic.SibSp.nunique()

7

In [15]:
len(titanic.SibSp.unique())

7

In [16]:
titanic.Sex.value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [18]:
titanic.Age.min(), titanic.Age.max()

(np.float64(0.42), np.float64(80.0))

In [20]:
titanic.Survived.mean()

np.float64(0.3838383838383838)

In [26]:
children = titanic.Age < 14
children.sum()

np.int64(71)

In [27]:
children.head(5)

0    False
1    False
2    False
3    False
4    False
Name: Age, dtype: bool

In [28]:
children.tail(5)

886    False
887    False
888    False
889    False
890    False
Name: Age, dtype: bool

In [29]:
(titanic.Age < 14).sum()

np.int64(71)

In [30]:
(titanic.Age < 14).mean()

np.float64(0.07968574635241302)

In [31]:
ab = titanic[titanic.SibSp.isin(["A", "B"])]
ab.shape

(0, 12)

In [32]:
ab.head(10)

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [33]:
titanic[["Sex", "Pclass", "Survived"]].sample(4)

        Sex  Pclass  Survived
85   female       3         1
86     male       3         0
163    male       3         0
806    male       1         0

In [34]:
pd.read_csv(r"C:\Users\Lenovo\Downloads\titanic.csv",
            usecols=["Sex", "Pclass", "Survived"]).sample(4)

     Survived  Pclass     Sex
214         0       3    male
438         0       1    male
30          0       1    male
469         1       3  female

In [37]:
titanic.drop(["Name", "SibSp",  "Parch", "Cabin", "Embarked",
              "Age","Ticket","Fare"],
             axis=1).sample(4)

     PassengerId  Survived  Pclass     Sex
183          184         1       2    male
456          457         0       1    male
18            19         0       3  female
176          177         0       3    male

In [39]:
titanic.drop(["Name", "SibSp",  "Parch", "Cabin", "Embarked",
              "Age","Ticket","Fare"],axis=1).sample(4)

     PassengerId  Survived  Pclass     Sex
359          360         1       3  female
850          851         0       3    male
514          515         0       3    male
646          647         0       3    male

In [40]:
titanic.groupby("Sex")

In [42]:
titanic.groupby("Sex").Survived.mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [43]:
titanic.groupby(["Sex", "Pclass"]).Survived.mean()

Sex     Pclass
female  1         0.968085
        2         0.921053
        3         0.500000
male    1         0.368852
        2         0.157407
        3         0.135447
Name: Survived, dtype: float64

In [44]:
titanic.Cabin.unique()

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [45]:
titanic.Cabin.str.contains(" ", na=False, regex=False).head(6)

0    False
1    False
2    False
3    False
4    False
5    False
Name: Cabin, dtype: bool

In [46]:
titanic.Cabin.head(6)

0     NaN
1     C85
2     NaN
3    C123
4     NaN
5     NaN
Name: Cabin, dtype: object

In [47]:
titanic.Cabin.str.contains(" ", na=False, regex=False).value_counts()

Cabin
False    867
True      24
Name: count, dtype: int64

In [48]:
titanic.Cabin.str.match(r"\w\d+$", na=False).value_counts()

Cabin
False    715
True     176
Name: count, dtype: int64

In [49]:
i = titanic.Cabin.str.match(r"\w\d+$", na=True)
titanic.Cabin[~i].sample(6)

473          D
339          T
498    C22 C26
97     D10 D12
715      F G73
327          D
Name: Cabin, dtype: object

In [50]:
(
    titanic
    .Cabin
    .str
    .replace(r"(\w).*", r"\1", regex = True)
    .dropna() 
    .sample(6)
)

449    C
185    A
763    B
298    C
248    D
6      E
Name: Cabin, dtype: object

In [51]:
titanic["deck"] = titanic.Cabin.str.replace(r"(\w).*", r"\1", regex = True)
titanic[["Cabin", "deck"]].dropna().sample(6)

    Cabin deck
835   E49    E
484   B49    B
1     C85    C
516   F33    F
690   B20    B
627    D9    D